---
kind: method
id: M:Autodesk.Revit.DB.LabelUtils.GetStructuralSectionShapeName(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape)
source: html/4969a1cc-9943-c418-dfca-9672b0fba75f.htm
---
# Autodesk.Revit.DB.LabelUtils.GetStructuralSectionShapeName Method

Gets the user-visible name for a StructuralSectionShape.

## Syntax (C#)
```csharp
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```

## Parameters
- **shape** (`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionShape`) - The StructuralSectionShape to get the user-visible name.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration